// Завдання на змінні

// Завдання 1: Створіть дві змінні a  та b, присвойте їм довільні числові значення.
// Виведіть у консоль результат їх множення.

const a = 11;
const b = 89;
console.log('Добуток чисел:', a * b);

// Завдання 2: Створіть дві змінні c  та d, присвойте їм довільні числові значення.
// Виведіть у консоль результат ділення першого на друге.

const c = 34;
const d = 14;
console.log('Частка від ділення c на d:', c / d);

// Завдання 3: Створіть дві змінні e  та f, присвойте їм довільні значення.
// Виведіть у консоль результат їхньої суми

const e = 12;
const f = 45;
console.log('Сума чисел:', e + f);

// Завдання 4: Визначте змінні зі значеннями 11, true, "java script", "100"  і виведіть їх в консоль

const numberValue = 11;
const isBoolValue = true;
const programLanguage = 'java script';
const stringValue = '100';

console.log(numberValue, isBoolValue, programLanguage, stringValue);

// Завдання 5: Переробіть наведений код так, щоб у ньому використовувалися операції +=, -=, *=, /=, ++, --

// Перероблений код:

let num = 1;
num += 11;
num -= 11;
num *= 11;
num /= 11;
num++; // Або ++num, залежить від застосування
num--; // Або --num, залежить від застосування

// Завдання на введення/виведення

// Завдання 1: Запитати число у користувача, піднести його до квадрату і вивести результат.

let numberToPow = Number(
  prompt('Введіть число для піднесення його до квадрату:')
);
numberToPow **= 2;
alert(numberToPow);

// Завдання 2: Вивести середнє арифметичне двох чисел. Числа запитувати у користувача.

const numberForAverage1 = Number(
  prompt('Введіть перше число для середнього арифметичного')
);
const numberForAverage2 = Number(
  prompt('Введіть друге число для середнього арифметичного')
);
const average = (numberForAverage1 + numberForAverage2) / 2;
alert(average);

// Завдання 3: Перевести кількість хвилин на секунди та вивести результат. Число хвилин запитувати у користувача.

const minutesCount = Number(
  prompt('Введіть кількість хвилин для переведення на секунди')
);
const secondsCount = minutesCount * 60;
alert(secondsCount);

// Завдання 4: Створіть змінну greeting зі значенням 'Hello,' і оголосіть змінну userName.
// Запитайте ім'я користувача та внесіть це значення у змінну userName.
// Виведіть повідомлення з привітанням, наприклад, 'Hello, Alex!' (згадайте про конкатенацію)

const greeting = 'Hello,';
let userName;
userName = prompt("Введіть своє ім'я");
alert(greeting + ' ' + userName + '!');
