// Завдання на змінні

// Завдання 1: Створіть дві змінні a  та b, присвойте їм довільні числові значення.
// Виведіть у консоль результат їх множення.

const a = 11;
const b = 89;
console.log('Добуток чисел:', a * b);

// Завдання 2: Створіть дві змінні c  та d, присвойте їм довільні числові значення.
// Виведіть у консоль результат ділення першого на друге.

const c = 34;
const d = 14;
console.log('Частка від ділення c на d:', c / d);

// Завдання 3: Створіть дві змінні e  та f, присвойте їм довільні значення.
// Виведіть у консоль результат їхньої суми

const e = 12;
const f = 45;
console.log('Сума чисел:', e + f);

// Завдання 4: Визначте змінні зі значеннями 11, true, "java script", "100"  і виведіть їх в консоль

const numberValue = 11;
const isBoolValue = true;
const programLanguage = 'java script';
const stringValue = '100';

console.log(numberValue, isBoolValue, programLanguage, stringValue);

// Завдання 5: Переробіть наведений код так, щоб у ньому використовувалися операції +=, -=, *=, /=, ++, --

// Перероблений код:

let num = 1;
num += 11;
num -= 11;
num *= 11;
num /= 11;
num++; // Або ++num, залежить від застосування
num--; // Або --num, залежить від застосування
